Testing/proj-test/loadtest.yml
config:
  target: 'http://localhost:8080'
  phases:
    - name: "User and LegoSet simulation"
      duration: 60
      arrivalRate: 2
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
  processor: "./test-utils.js"

scenarios:
  - name: "Full flow: register, login, create LegoSet, comment"
    flow:
      # 1. Create a new random user
      - function: "genNewUser"
      - post:
          name: "Register user"
          url: "/auth/register"
          headers:
            Content-Type: application/json
          json:
            username: "{{ uName }}"
            email: "{{ uId }}@example.com"
            password: "{{ uPwd }}"
          capture:
            headers:
              Set-Cookie:
                as: sessionCookie

      # 2. Login user
      - post:
          name: "Login user"
          url: "/auth/login"
          headers:
            Content-Type: application/json
          json:
            email: "{{ uId }}@example.com"
            password: "{{ uPwd }}"
          capture:
            headers:
              Set-Cookie:
                as: sessionCookie

      # 3. Get user profile
      - get:
          name: "Get user profile"
          url: "/users/profile"
          headers:
            Cookie: "{{ sessionCookie }}"
          capture:
            json:
              "$.id":
                as: userId

      # 4. Create a LegoSet
      - function: "genNewLegoSet"
      - post:
          name: "Create LegoSet"
          url: "/legoset/create"
          headers:
            Content-Type: application/json
            Cookie: "{{ sessionCookie }}"
          json:
            name: "{{ lsName }}"
            description: "{{ lsDescription }}"
          capture:
            json:
              "$.id":
                as: legoSetId

      # 5. Post a comment on LegoSet
      - function: "genProductComment"
      - post:
          name: "Post comment"
          url: "/legoset/{{ legoSetId }}/comment/post"
          headers:
            Content-Type: text/plain
            Cookie: "{{ sessionCookie }}"
          body: "{{ cmtText }}"

      # 6. List comments
      - get:
          name: "List comments"
          url: "/legoset/{{ legoSetId }}/comment/list"

      # 7. Update user profile
      - put:
          name: "Update user profile"
          url: "/users/update"
          headers:
            Content-Type: application/json
            Cookie: "{{ sessionCookie }}"
          json:
            bio: "Testing Artillery {{ uName }}"
            country: "Norway"

      # 8. Logout
      - get:
          name: "Logout user"
          url: "/auth/logout"
          headers:
            Cookie: "{{ sessionCookie }}"